<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;

use Carbon\Carbon;
use Illuminate\Support\Facades\DB;
use App\Traits\ConsumeInternalService;

class RecipesTableSeeder extends Seeder
{
    use ConsumeInternalService;

    public function __construct()
    {
        $this->baseUri = config('services.ingredients.base_uri');
    }

    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $_recipes = [
            ['tarator', 'tarator', 'Таратор', '[{"id": "261", "name": "краставица", "unit": "брой", "quantity": "1"}, {"id": "163", "name": "кисело мляко", "unit": "грама", "quantity": "400"}, {"id": "113", "name": "копър", "unit": "връзка", "quantity": "1/2"}, {"id": "304", "name": "чесън", "unit": "скилидки", "quantity": "3"}, {"id": "220", "name": "орехи", "unit": "грама", "quantity": "20"}, {"id": "224", "name": "олио", "unit": "супени лъжици", "quantity": "2"}, {"id": "195", "name": "вода", "unit": "мл", "quantity": "300"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за таратор е подготовката на краставиците. Измивате краставицата и я обелвате. Ако сте успели да се сдобиете с пресни краставици, произведени от някоя баба на село няма нужда да ги белите. Нарязвате я на много малки парченца / кубчета. Много домакини настъргват краставицата, за да спестят време. Така краставицата омеква повече и тараторът става като каша. Но в случай, че сте наистина жадни и не можете  да чакате дълго, можете да ползвате и този метод."}, {"step": "2", "text": "Изсипвате краставицата в голяма купа и прибавяте към нея ситно нарязания копър (може да ползвате и сух копър), смлените орехи и чесъна, който сте счукали, или нарязали на много дребно. За разлика от французите обаче много българи не обичат чесън, затова можете да не добавяте чесъна към таратора, а да го оставите в отделна чинийка, така всички ще са доволни: любителите на чесън ще си добавят в последствие, а противниците няма да се мръщят."}, {"step": "3", "text": "След като сте прибавили чесъна, орехите и копъра поселете, добавете и олиото/зехтина и разбъркайте добре. След това разбийте една кофичка мляко с една кофичка студена вода, добавете към сместа с краставиците и пак разбъркайте. Тараторът е вече готов."}]'],
            ['pileshka-supa', 'pileshka supa', 'Пилешка супа', '[{"id": "121", "name": "пилешко месо", "unit": "грама", "quantity": "500"}, {"id": "255", "name": "картофи", "unit": "броя", "quantity": "2"}, {"id": "272", "name": "моркови", "unit": "брой", "quantity": "1"}, {"id": "267", "name": "лук", "unit": "брой", "quantity": "1"}, {"id": "6", "name": "фиде", "unit": "грама", "quantity": "30"}, {"id": "104", "name": "магданоз", "unit": "връзка", "quantity": "1/2"}]', '[{"step": "1", "text": "В голяма тенджера слагате около 2 литра вода. добавяте пилешкото месо и сол на вкус (около 1/2 чаена лъжица). Колкото повече е пилешкото месо, толкова по-силен ще стане бульонът и толкова по-вкусна ще стане супичката. Ако пък имате баба на село, или пък някаква друга връзка със село е най-добре да си вземете едно домашно пиле, тогава супата ще стане много по-ароматна и със сигурност ще е много по-вкусна!  Имайте предвид обаче, е домашното пиле трябва да ври поне час, за да се свари.По време на варенето на пилето най-вероятно ще се образува пяна, която трябва да отстраните. След като се свари пилето извадете месото от бульона и го прецедете. А кога е сварено пилешкото месо ще разберете като пробвате с виличка. Когато лесно се отделя от костите, значи е готово."}, {"step": "2", "text": "Нарязвате зеленчуците на малки кубчета. Към бульона добавете първо моркова и лука. След като  поврят  5 минути добавете и нарязаните на дребно картофи, а след още 5 минути добавете и натрошеното фиде и варете до пълно сваряване на фидето и картофите."}, {"step": "3", "text": "Обезкостете свареното пилешко месо и го накъсайте на дребни парченца, които добавете към супата. Накрая, след като свалите пилешката супа от котлона поръсете със ситно нарязан магданоз. Не е необходимо пилешката супа да ври с магданоза, така той остава свеж, не губи от полезните си вещества, а същевременно овкусява достатъчно добре."}]'],
            ['shkembe-chorba', 'shkembe chorba', 'Шкембе чорба', '[{"id": "10", "name": "шкембе", "unit": "гр", "quantity": "300"}, {"id": "214", "name": "прясно мляко", "unit": "мл", "quantity": "300"}, {"id": "215", "name": "краве масло", "unit": "гр", "quantity": "30"}, {"id": "143", "name": "червен пипер", "unit": "чаени лъжици", "quantity": "2"}, {"id": "222", "name": "бяло брашно", "unit": "супена лъжица", "quantity": "1"}, {"id": "119", "name": "черен пипер", "unit": "чаена лъжица", "quantity": "1/2"}, {"id": "304", "name": "чесън", "unit": "глава", "quantity": "1"}, {"id": "138", "name": "оцет", "unit": "кафена чаша", "quantity": "1"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за шкембе чорба е подготовката на шкембето. Може да ползвате готово бланширано или сварено шкембе и да си спестите времето за варене на шкембето. Шкембето трябва да е измито и добре почистено. Може да приготвите шкембе чорба, както със свинско, така и с телешко, или агнешко шкембе. В зависимост от това, какво ще е шкембето ще ви е необходимо и различно време за приготвяне. Агнешкото шкембе се сварява за около час, докато свинското и телешкото трябва да се варят с часове, докато омекнат. Сварявате шкембето без сол, докато омекне. а може да ползвате и готово бланширано шкембе, като си спестите времето за варене. Изваждате шкембето и към 1 литър бульон добавете горещото прясно мляко, 2 чаени лъжици сол и ½ чаена лъжица черен пипер."}, {"step": "2", "text": "Свареното шкембе нарязвате на ситно. В дълбок тиган сгорещявате кравето масло, добавяте червения пипер и брашното и ги запържвате за около минута - две, след което добавяте няколко лъжици от бульона и бъркате докато се получи еднородна смес."}, {"step": "3", "text": "Изсипвате запръжката в бульона, добавяте и нарязаното шкембе и оставяте супата да поври няколко минути."}]'],
            ['lescha-chorba', 'lescha chorba', 'Леща чорба', '[{"id": "265", "name": "леща", "unit": "чаена чаша", "quantity": "1"}, {"id": "267", "name": "лук", "unit": "глава", "quantity": "1"}, {"id": "272", "name": "моркови", "unit": "брой", "quantity": "1"}, {"id": "", "name": "червен пипер", "unit": "брой", "quantity": "1"}, {"id": "146", "name": "домати", "unit": "броя", "quantity": "2"}, {"id": "144", "name": "чубрица", "unit": "чаена лъжица", "quantity": "1"}, {"id": "143", "name": "червен пипер", "unit": "чаена лъжица", "quantity": "1"}, {"id": "224", "name": "олио", "unit": "супени лъжици", "quantity": "5"}, {"id": "222", "name": "бяло брашно", "unit": "супена лъжица", "quantity": "1"}, {"id": "304", "name": "чесън", "unit": "скилидки", "quantity": "5"}, {"id": "227", "name": "сол", "unit": "чаена лъжица", "quantity": "1"}]', '[{"step": "1", "text": "Измиваме и заливаме лещата със студена вода в тенджера и слагаме на котлона. След като поври пет минути я прецеждаме и заливаме с гореща вода около 1,5 литра и връщаме на котлона."}, {"step": "2", "text": "Веднага добавяме вече нарязаните на ситно лук, морков, чушка, домат( може и от консерва), 2 супени лъжици олио и оставяме супата да ври до сваряване на продуктите. След това добавяме 1 чаена лъжица сол и наситненият чесън."}, {"step": "3", "text": "За така приготвената супа приготвяме застройка, като в тиган загряваме останалото олио и запържваме първо брашното за минута. След това добавяме и червеният пипер, и запържваме още за 1-2 минути. Готовата застройка добавяме към супата, поръсваме с чубрицата и лещата чорба е готова."}]'],
            ['supa-ot-zelen-bob', 'supa ot zelen bob', 'Супа от зелен боб', '[{"id": "85", "name": "зелен боб", "unit": "грама", "quantity": "500"}, {"id": "267", "name": "лук", "unit": "глава", "quantity": "1"}, {"id": "224", "name": "олио", "unit": "мл", "quantity": "50"}, {"id": "222", "name": "бяло брашно", "unit": "супена лъжица", "quantity": "1"}, {"id": "143", "name": "червен пипер", "unit": "чаена лъжица", "quantity": "1"}, {"id": "213", "name": "яйца", "unit": "броя", "quantity": "2"}, {"id": "163", "name": "кисело мляко", "unit": "чаена чаша", "quantity": "2/3"}, {"id": "304", "name": "чесън", "unit": "скилидки", "quantity": "4"}, {"id": "113", "name": "копър", "unit": "връзка", "quantity": "1/2"}, {"id": "227", "name": "сол", "unit": "чаена лъжица", "quantity": "1"}]', '[{"step": "1", "text": "Първата стъпка е подготовката на продуктите и съдовете, които ще използваме.Започваме с подготовката на зеления боб. Измиваме и го почистваме, като отрязваме двете крайчета на всяка шушулка, и го режеме на едри парчета. Слагаме подготвеният зелен боб в тенджера и го заливаме със студена вода. Около 1.5л. Слагаме го да ври на котлона до омекване."}, {"step": "2", "text": "През това време в сгорещеното олио добавяме наситненият лук и задушаваме под капак на слаб огън до омекване, след което добавяме брашното и червеният пипер и запържваме за 2-3 минути, и го сваляме от котлона. Когато зеленият боб е омекнал добавяме в тенджерата сместа с лука, сол - 1чаена лъжица и наситненият чесън. Разбъркваме добре и слагаме супата да поври още за около 5 минути. Сваляме супата от котлона."}, {"step": "3", "text": "След като супата е вече готова, подготвяме застройката. За да сме сигурни, че застройката няма да се пресече, отделяме белтъците и разбиваме само жълтъците с киселото мляко, с помощта на вилица. Към приготвената застройка на тънка струйка добавяме от бульона на супата( 1к. чаша) и с така приготвената смес застройваме супата и разбъркваме добре за да може текстурата на супата да стане гладка. Нашата супа от зелен боб е готова. На всяка порция поръсваме наситнен пресен копър( може и сух)."}]'],
            ['krem-supa-ot-kartofi', 'krem supa ot kartofi', 'Крем супа от картофи', '[{"id": "255", "name": "картофи", "unit": "кг", "quantity": "1"}, {"id": "272", "name": "моркови", "unit": "броя", "quantity": "2"}, {"id": "267", "name": "лук", "unit": "брой", "quantity": "1"}, {"id": "215", "name": "краве масло", "unit": "грама", "quantity": "30"}, {"id": "214", "name": "прясно мляко", "unit": "мл", "quantity": "100"}, {"id": "104", "name": "магданоз", "unit": "връзка", "quantity": "1/4"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за крем супа от картофи е подготовката на продуктите. Почистете картофите, моркова и лука и ги варете в подсолена вода, докато омекнат. Зеленчуците са достатъчно сварени, когато можете да ги набучите лесно с вилица. Важно е да се сварят добре, за да се получи в последствие гладка, а не хрупкава картофена крем-супа."}, {"step": "2", "text": "Пасирайте сварените зеленчуци с пасатор, или кухненски робот до получаването на еднородна смес. Не изхвърляйте водата, в която са врели зеленчуците."}, {"step": "3", "text": "Добавете към получената смес маслото, прясното мляко и около половин литър от водата, в която са врели зеленчуците. Разбъркайте добре до получаване на хомогенна смес и върнете за още 5 минути крем-супата от картофи на котлона."}]'],
            ['gaspacho', 'gaspacho', 'Гаспачо', '[{"id": "146", "name": "домати", "unit": "кг", "quantity": "1"}, {"id": "261", "name": "краставица", "unit": "брой", "quantity": "1"}, {"id": "105", "name": "червен пипер", "unit": "брой", "quantity": "1"}, {"id": "267", "name": "лук", "unit": "брой", "quantity": "1/2"}, {"id": "304", "name": "чесън", "unit": "скилидки", "quantity": "3"}, {"id": "104", "name": "магданоз", "unit": "връзка", "quantity": "1/2"}, {"id": "94", "name": "хляб", "unit": "филийки", "quantity": "2"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за Гаспачо е да обелите доматите от люспите. Ако са добре узрели няма да имате проблем, но ако не са все още меки беленето ще стане по-трудно. Лесен вариант за белене на доматите е следният: правите по едно кръстче с нож от долната страна на всеки домат, след  което ги пускате за няколко секунди във вряща вода. Доматите трябва да стоят във врящата вода наистина няколко секунди, защото в противен случай ще се сварят, а за гаспачо са нужни сурови домати. След това ги вадите от водата, например с решетъчна лъжица, или пък с вилица и веднага ги слагате в купа със студена вода. От рязката смяна на температурата люспите на доматите се отделят много лесно.Обелените домати  пюрирате в кухненски робот, или блендер за няколко секунди. Не трябва да се получава пюре, а да останат и парченца домати в доматената супа."}, {"step": "2", "text": "Измивате, обелвате краставицата и я нарязвате на възможно по-дребни парченца. Почиствате и чушката и нея нарязвате по същия начин. Така постъпвате и с чесъна, лука и магданоза. Смесвате всички зеленчуци с пюрираните домати. Подправяте със солта и черния пипер, добавяте и 2-3 супени лъжици зехтин. И супата е готова!"}, {"step": "3", "text": " (По желание) Накисвате филийките хляб във вода, отцеждате ги добре и ги добавяте към супата. Според някои от рецептите за гаспачо, хляб се добавя, според други не. С добавен хляб студената супа става по-плътна."}]'],
            ['bob-chorba', 'bob chorba', 'Боб чорба по традиционна рецепта', '[{"id": "14", "name": "боб", "unit": "чаена чаша", "quantity": "1"}, {"id": "272", "name": "моркови", "unit": "брой", "quantity": "1"}, {"id": "267", "name": "лук", "unit": "глава", "quantity": "1"}, {"id": "105", "name": "червен пипер", "unit": "брой", "quantity": "1"}, {"id": "103", "name": "джоджен", "unit": "чаена лъжица", "quantity": "1"}, {"id": "143", "name": "червен пипер", "unit": "чаена лъжица", "quantity": "1"}, {"id": "122", "name": "мащерка", "unit": "чаена лъжица", "quantity": "1/2"}]', '[{"step": "1", "text": "Първата стъпка при всички рецепти с боб е подготовката на боба. Предварителната обработка на боба се налага поради две причини: от една страна, за да уври по-бързо и да не остане „хрупкав“, от друга, за да не ви се подуят коремчетата след като похапнете сладко купичка вкусна боб чорба. Всяка баба има своя тайна за варене на боб: някои слагат една чаена лъжица захар, други една  супена лъжица ракиа, или пък малко хлебна сода. Дали тези тези трикове имат ефект е спорно. Има обаче един 100% доказан метод за по-бързо сваряване на боба: накиснете го в студена вода за около 7-8 часа. Така ако го накиснете вечерта преди да си легнете на сутринта ще е готов за варене."}, {"step": "2", "text": "Изсипвате водата, в която е стоял бобът, измивате го и го слагате да заври в голяма тенджера. След като заври изсипвате водата, измивате го, наливате 1,5 л вода и го връщате на котлона. След като заври отстранявате с лъжица пяната, която се получава. Оставяте боба да ври на слаб огън.                                                                                                       ! Много важно е да знаете, че при варенето на боб солта се слага накрая! Ако посолите още в началото на варенето, то вашият боб няма почти никакви шансове да се свари. Дайте шанс на боба – сложете сол накрая! ;)"}, {"step": "3", "text": "Бобът ври на слаб огън около час, докато поомекне. Но тъй като на пазара има боб с различно качество, който увира за различно време най-добре е да не се доверявате на минутите, които производителят е написал на опаковката, защото те често са недостатъчни. За по-сигурно разбъркайте боба с дървена лъжица, ако не потраква и бобчетата не се удрят шумно в стените на тенджерата, значи се е посварил. Друг, много лесен и може би най-надежден начин е да пробвате едно бобче, ако е поомекнало, значи е дошъл момента да добавите ситно нарязаните зеленчуци."}]'],
            ['gubena-supa', 'gubena supa', 'Гъбена супа', '[{"id": "89", "name": "гъби", "unit": "грама", "quantity": "500"}, {"id": "272", "name": "моркови", "unit": "брой", "quantity": "1"}, {"id": "267", "name": "лук", "unit": "брой", "quantity": "1"}, {"id": "301", "name": "целина", "unit": "гр", "quantity": "100"}, {"id": "276", "name": "ориз", "unit": "кафена чаша", "quantity": "1"}, {"id": "104", "name": "магданоз", "unit": "връзка", "quantity": "1/2"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за гъбена супа е подготовката на гъбите. Измийте, почистете и нарежете моркова, лука и целината на дребно, след което изсипете нарязаните на дребно зеленчуци в сгорещеното олио и задушавате за около 5 минути, като разбърквате непрекъснато."}, {"step": "2", "text": "Почиствате, измивате и нарязвате гъбите на ивици и ги добавяте към задушените зеленчуци. Задушавате и гъбите при непрекъснато бъркане за около 5 минути, след което добавяте сол (около една чаена лъжица) и 1,5 литър вода. Гъбената супа ври около 15-тина минути."}, {"step": "3", "text": "Измития ориз добавяте към гъбената супа и варите до пълното му сваряване. Най-добре е да пробвате зрънцата ориз, оризът трябва да е напълно омекнал, защото в противен случай вашата гъбена супа ще хрупа."}]'],
            ['krem-supa-ot-gubi', 'krem supa ot gubi', 'Крем супа от гъби', '[{"id": "89", "name": "гъби", "unit": "грама", "quantity": "300"}, {"id": "267", "name": "лук", "unit": "брой", "quantity": "1"}, {"id": "215", "name": "краве масло", "unit": "супени лъжици", "quantity": "3"}, {"id": "222", "name": "бяло брашно", "unit": "супени лъжици", "quantity": "3"}, {"id": "214", "name": "прясно мляко", "unit": "чаена чаша", "quantity": "1/2"}, {"id": "195", "name": "вода", "unit": "1/2 чаена чаша", "quantity": "1"}, {"id": "113", "name": "копър", "unit": "връзка", "quantity": "1/3"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за крем супа е подготовката на продуктите. Нарязвате праза/лука на дребно. Измивате гъбите и ги нарязвате на тънки ивички. В тенджерата, в която ще варите супата, разтопявате маслото и след като се сгорещи изсипвате нарязаните на ситно праз и гъби, добавете сол и задушете при непрекъснато разбъркване докато омекнат напълно - за около 5 минути."}, {"step": "2", "text": "Към задушените зеленчуци малко по малко добавяте пресятото брашно при непрекъснато бъркане. Важно е да не изсипете брашното изведнъж, защото в противен случай ще се получат бучки и крем-супата от гъби няма да стане гладка."}, {"step": "3", "text": "Добавяте водата и леко затопленото мляко и разбърквате много старателно, за да се получи гладка гъбена крем-супа. Варите супата на слаб огън за около 15-20 минути. Ако обичате черен пипер непременно добавете малко към края на варенето.                                                                                                                                           Преди сервиране може да поръсите готовата крем-супа от гъби със ситно нарязан пресен копър, който освен, че ще „разкраси“ вашата крем супа, ще я освежи и ще я направи още по-ароматна. А за да стане вашата гъбена крем-супа по-засищаща добавете към всяка купичка и шепа ароматни хрупкави крутони."}]'],
            ['supa-topcheta', 'supa topcheta', 'Супа топчета', '[{"id": "132", "name": "кайма", "unit": "грама", "quantity": "250"}, {"id": "267", "name": "лук", "unit": "брой", "quantity": "1"}, {"id": "272", "name": "моркови", "unit": "броя", "quantity": "2"}, {"id": "301", "name": "целина", "unit": "грама", "quantity": "30"}, {"id": "146", "name": "домати", "unit": "брой", "quantity": "1"}, {"id": "276", "name": "ориз", "unit": "кафена чаша", "quantity": "1"}, {"id": "163", "name": "кисело мляко", "unit": "супени лъжици", "quantity": "4"}, {"id": "213", "name": "яйца", "unit": "броя", "quantity": "2"}, {"id": "119", "name": "черен пипер", "unit": "чаена лъжица", "quantity": "1/2"}, {"id": "104", "name": "магданоз", "unit": "връзка", "quantity": "1/2"}]', '[{"step": "1", "text": "Първо трябва да приготвите малките кюфтенца за супата. Смесвате каймата с ½ от ориза, ½ глава ситно нарязан лук, 1 яйце, ситно нарязания магданоз и черен пипер. Омесвате добре и оставяте сместа да престои около 40 минути, след което от нея оформяте малко топчета (приблизително с големината на лешник). Внимавайте с размера на топчетата, защото ако са твърде големи вашата супа топчета ще се превърне в супа кюфтета ;)"}, {"step": "2", "text": "Нарязвате останалата ½ глава лук, морковите и резена целина на дребно и ги изсипвате в 2 литра вряща вода. След като зеленчуците поврат 5 минути към врящия бульон добавяте внимателно топчетата, като след като ги пуснете във водата ги разбъркате съвсем леко, за да не се слепят. Допълнително мазнина към супата не се добавя, тъй като по време на варенето малките кюфтенца пускат мазнина, която е напълно достатъчна. След като супата отново заври добавяте и останалия ориз, а след още 10 минути и ситно нарязания домат."}, {"step": "3", "text": "Класическата супа топчета задължително се застройва! Застройката се приготвя по класически начин, като разбивате яйцето и киселото мляко, добавяте 2-3 черпака от поизстинания бульон на тънка струйка при непрекъснато бъркане, след което така получената смес връщате отново към супата (не трябва да е вряща в никакъв случай, за да не се пресече!). Може да застроите супата като ползвате за приготвянето ѝ само жълтъците, така ще сте спокойни, че застройката няма да се пресече."}]'],
            ['ribena-chorba', 'ribena chorba', 'Рибена чорба', '[{"id": "9", "name": "риба", "unit": "грама", "quantity": "500"}, {"id": "272", "name": "моркови", "unit": "броя", "quantity": "2"}, {"id": "301", "name": "целина", "unit": "глава", "quantity": "1/2"}, {"id": "255", "name": "картофи", "unit": "броя", "quantity": "2"}, {"id": "267", "name": "лук", "unit": "глава", "quantity": "1"}, {"id": "80", "name": "девесил", "unit": "връзка", "quantity": "1/2"}, {"id": "119", "name": "черен пипер", "unit": "чаена лъжица", "quantity": "1/2"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за рибена чорба е сваряването на рибата. Може да ползвате различни по вид риба. Рибената чорба на снимката е приготвена от главата и опашката на една риба толстолоб. Имайте предвид, че ако ползвате само глави и опашки е добре те да бъдат така отрязани, че да е останало и от месето на рибата.В голяма тенджера слагате рибата, добавяте 1 чаена лъжица сол и заливате с вода, така че водата напълно да покрива рибата. Варите до пълно сваряване на рибата, след което я изваждате с решетъчна лъжица от бульона, а самият бульон прецеждате през ситна цедка. След като рибата изстине старателно я почистете от костите."}, {"step": "2", "text": "Докато рибата ври измийте и почистете морковите, картофите и целината и ги нарежете на дребни кубчета. Почистете лука и го нарежете на много ситно.Добавете всички зеленчуци към прецедения бульон и върнете тенджерата на котлона."}, {"step": "3", "text": "След като зеленчуците поврат около десет минути и са полусварени добавете почистената риба и ситно нарязания девисил и черния пипер и оставете да поври още около десет минути."}]'],
            ['krem-supa-ot-chervena-lescha', 'krem supa ot chervena lescha', 'Крем супа от червена леща', '[{"id": "7", "name": "червена леща", "unit": "чаена чаша", "quantity": "1"}, {"id": "272", "name": "моркови", "unit": "бр", "quantity": "1"}, {"id": "267", "name": "лук", "unit": "глава", "quantity": "1"}, {"id": "98", "name": "куркума", "unit": "чаена лъжица", "quantity": "1/2"}, {"id": "107", "name": "къри", "unit": "чаена лъжица", "quantity": "1/2"}, {"id": "97", "name": "кимион", "unit": "чаена лъжица", "quantity": "1/2"}, {"id": "108", "name": "дафинов лист", "unit": "бр", "quantity": "2"}, {"id": "224", "name": "олио", "unit": "кафена чаша", "quantity": "1/2"}]', '[{"step": "1", "text": "Първа стъпка от рецептата за крем супа от червена леща е подготовката на зеленчуците. Измийте моркова и го настържете, а лука нарежете на дребно. В тенджера изсипете олиото и след като се сгорещи добавете зеленчуците. Разбъркайте добре и задушете за 3-4 минути. След това добавете измитата червена леща и един литър вода."}, {"step": "2", "text": "След като супата заври добавете и подправките и посолете с ½ чаена лъжица сол. Варете супата докато лещата се свари, за което ще са нужни около 30 минути. След като лещата е сварена извадете дафиновите листа и пасирайте с кухненски робот или пасатор. Преди сервиране може да поръсите с ситно нарязан пресен магданоз."}]'],

            ['ungarski-gulash', 'ungarski gulash', 'Унгарски гулаш', '[
                {
                    "id": "419",
                    "name": " телешки джолан",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "58",
                    "name": " картофи",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "50",
                    "name": " моркови",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "96",
                    "name": " зелен пипер",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "52",
                    "name": " пащърнак",
                    "unit": "грама",
                    "quantity": "250"
                },
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "3"
                },
                {
                    "id": "223",
                    "name": " червен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "224",
                    "name": " червен лют пипер",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "206",
                    "name": " кимион",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "211",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "60"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "36"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],
            ['krem-supa-brokoli', 'krem supa brokoli', 'Крем супа броколи', '[
                {
                    "id": "65",
                    "name": " броколи",
                    "unit": "грама",
                    "quantity": "300"
                },
                {
                    "id": "429",
                    "name": " вода",
                    "unit": "милилитра",
                    "quantity": "500"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "58",
                    "name": " картофи",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "261",
                    "name": " крема сирене",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "445",
                    "name": " зехтин",
                    "unit": "милилитра",
                    "quantity": "5"
                },
                {
                    "id": "252",
                    "name": " прясно мляко",
                    "unit": "милилитра",
                    "quantity": "10"
                },
                {
                    "id": "201",
                    "name": " индийско орехче",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],
            ['gulash', 'gulash', 'Гулаш', '[
                {
                    "id": "410",
                    "name": " свинско месо",
                    "unit": "грама",
                    "quantity": "700"
                },
                {
                    "id": "100",
                    "name": " патладжан",
                    "unit": "грама",
                    "quantity": "1"
                },
                {
                    "id": "104",
                    "name": " червен пипер",
                    "unit": "броя",
                    "quantity": "4"
                },
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "броя",
                    "quantity": "5"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "5"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "223",
                    "name": " червен пипер",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "233",
                    "name": " мащерка",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "214",
                    "name": " риган",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "225",
                    "name": " чубрица",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "211",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "10"
                }
            ]', '[]'],
            ['spanachena-supa', 'spanachena supa', 'Спаначена супа', '[
                {
                    "id": "80",
                    "name": " спанак",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "242",
                    "name": " варени яйца",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "252",
                    "name": " прясно мляко",
                    "unit": "милилитра",
                    "quantity": "200"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "20"
                },
                {
                    "id": "74",
                    "name": " магданоз",
                    "unit": "връзка",
                    "quantity": "1"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "10"
                }
            ]', '[]'],
            
            ['salata-kapreze-s-domati-motsarela-i-bosilek', 'salata kapreze s domati motsarela i bosilek', 'Салата Капрезе с домати, моцарела и босилек', '[{"id": "146", "name": "домати", "unit": "броя", "quantity": "2"}, {"id": "273", "name": "моцарела", "unit": "броя", "quantity": "2"}, {"id": "127", "name": "босилек", "unit": "листа", "quantity": "15"}, {"id": "142", "name": "зехтин", "unit": "супени лъжици", "quantity": "2"}, {"id": "74", "name": "балсамов оцет", "unit": "супена лъжица", "quantity": "1"}]', '[{"step": "1", "text": "Нарязвате доматите и моцарелата на колелца и ги нареждате в чиния, като върху всяко кръгче домат поставяте по едно кръгче сирене моцарела. Може да ги наредите в кръг, като застъпвате краищата на всяко парченце, или пък да бъдат самостоятелни."}, {"step": "2", "text": "След като наредите доматите и моцарелата идва ред на босилека. Ако ползвате пресен босилек, може да поставите по едно листенце върху всяко парченце моцарела, или да го нарежете на много ситно и да поръсите върху цялата салата, както е и на снимката. Ако ползвате сух босилек, то просто поръсете салатата с него. Салатата Капрезе става много по-вкусна с пресния босилек, защото той придава много повече свежест и е много по-ароматен от сухия босилек. За жалост пресният босилек е почти неоткриваем в повечето магазини, само големите вериги предлагат свежа тази подправка. Свеж босилек има разбира се и на пазара. Най-лесно е обаче да си посеете в саксия и да си го отглеждате вкъщи. Така ще си имате свеж босилек всеки път, когато ви потрябва."}, {"step": "3", "text": "Салатата се подправя със сол и смес от зехтина и балсамовия оцет. Ако нямате балсамов оцет, или пък не обичат много много киселото, можете да подправите и само със зехтин."}]'],
            ['zelena-salata-klasicheska-retsepta', 'zelena salata - klasicheska retsepta', 'Зелена салата - класическа рецепта', '[{"id": "33", "name": "зелена салата", "unit": "брой", "quantity": "1"}, {"id": "291", "name": "спанак", "unit": "листа", "quantity": "15"}, {"id": "24", "name": "репички", "unit": "броя", "quantity": "5"}, {"id": "41", "name": "варени яйца", "unit": "брой", "quantity": "1"}, {"id": "102", "name": "пресен лук", "unit": "връзка", "quantity": "1/2"}, {"id": "82", "name": "пресен чесън", "unit": "връзка", "quantity": "1/2"}, {"id": "25", "name": "кълнове", "unit": "грама", "quantity": "50"}, {"id": "272", "name": "моркови", "unit": "брой", "quantity": "1"}, {"id": "271", "name": "маслини", "unit": "броя", "quantity": "8"}, {"id": "201", "name": "ленено семе", "unit": "супена лъжица", "quantity": "1"}, {"id": "22", "name": "слънчогледови семки", "unit": "супена лъжица", "quantity": "1"}]', '[{"step": "1", "text": "Едно то на-важните неща при приготвянето на зелена салата, за да остане тя по-свежа и пухкава е, че зелените салатки и марулите трябва да се късат с ръце, а не да се режат с нож. Накъсаните зелени салатки остават много по-сочни и не се смачкват, както когато са нарязани с нож. Освен, че губят добрия си външен вид, когато са нарязани с нож те се окисляват и губят голяма част от полезните си свойства. В голяма купа накъсвате измитата салатка и листата спанак. Измивате и нарязвате на дребно чесъна, лука и репичките. Почиствате и измивате моркова, настъргвате го на едро ренде и го добавяте заедно с другите нарязани зеленчуци към накъсаните салатки и спанак."}, {"step": "2", "text": "Най-освежаващият елемент на тази зелена салата са кълновете. За почитателите на диетичното и здравословно хранене ползването на кълнове в кухнята не е новост. Свежите кълнове са много полезни, често са наричани жива храна. Кълновете от люцерна са много свежи и сочни, а кълновете от кресон имат леко парлив приятен вкус – чудесно допълнение към всяка свежа салата. Може да ползвате и други кълнове – кълнове от жито, или пък овесени кълнове. Преди да ги добавите към салатата задължително ги измийте, „разчепкайте ги” добре, като ги отделите доколкото е възможно един от друг, за да не останат на топка в салатата."}, {"step": "3", "text": "След като всички зеленчуци са в купата идва и момента за овкусяването ѝ. Изцеждате сока на ¼ лимон, добавяте сол и 2-3 супени лъжици зехтин и разбърквате добре. Добавяте семената и маслините и отново разбърквате внимателно, за да остане салатата максимално свежа и пухкава. Преди сервиране украсявате със свареното яйце."}]'],
            ['shopska-salata', 'shopska salata', 'Шопска салата', '[{"id": "146", "name": "домати", "unit": "кг", "quantity": "1"}, {"id": "261", "name": "краставица", "unit": "броя", "quantity": "2"}, {"id": "105", "name": "червен пипер", "unit": "броя", "quantity": "3"}, {"id": "267", "name": "лук", "unit": "глава", "quantity": "1"}, {"id": "131", "name": "сирене", "unit": "грама", "quantity": "200"}, {"id": "104", "name": "магданоз", "unit": "връзка", "quantity": "1/2"}]', '[{"step": "1", "text": "Измивате добре зеленчуците. Обелвате краставицата. Нарязвате доматите и краставицата на кубчета, а чушките на ивички. Добавяте и нарязания на дребно лук."}, {"step": "2", "text": "Към нарязаните зеленчуци добавяте натрошеното сирене, както и нарязания на дребно магданоз. Подправяте със зехтин или олио и разбърквате добре, за да могат зеленчуците да се овкусят добре. Вашата шопска салата е готова и може да бъде сервирана."}]'],
            ['kiopoolu', 'kiopoolu', 'Кьопоолу', '[{"id": "277", "name": "патладжан", "unit": "броя", "quantity": "2"}, {"id": "105", "name": "червен пипер", "unit": "броя", "quantity": "4"}, {"id": "146", "name": "домати", "unit": "брой", "quantity": "1"}, {"id": "304", "name": "чесън", "unit": "скилидки", "quantity": "4"}, {"id": "142", "name": "зехтин", "unit": "супени лъжици", "quantity": "3"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за кьопоолу е подготовката на продуктите. Класическият начин за приготвяне на кьопоолу е да изпечете патладжана, чушките и домата на жар. Безспорно така кьопоолуто става най-вкусно. Но за жалост малко от нас имат възможността да приготвят и пържолите, и зеленчуците на жар всеки път, когато ни се хапва. Затова не е фатално изпечете зеленчуците и във фурната. Ако печете зеленчуците във фурната ги сложете в тава и ги печете в предварително загрята на 200 градуса фурна, като след  като се изпекат от едната страна ги обърнете, за да се изпекат и от другата."}, {"step": "2", "text": "След като изпечете зеленчуците ги почистете от люспите и дръжките. Нарежете ги на едри парчета и заедно с почистените скилидки чесън, още докато са топли ги счукайте в дървено хаванче до получаване на каша. Добавете ½ чаена лъжица сол и 2 супени лъжици олио или зехтин и разбъркайте добре, за да може вашето кьопоолу да се овкуси добре. Ако нямате дървено хаванче няма проблем да приготвите кьопоолуто и като нарежете печените зеленчуци и чесъна на много дребни парченца и след това овкусите."}]'],
            ['salata-tabule-s-kinoa', 'salata tabule s kinoa', 'Салата Табуле с киноа', '[{"id": "110", "name": "киноа", "unit": "чаена чаша", "quantity": "1/2"}, {"id": "104", "name": "магданоз", "unit": "връзка", "quantity": "1"}, {"id": "267", "name": "лук", "unit": "глава", "quantity": "1/2"}, {"id": "146", "name": "домати", "unit": "брой", "quantity": "1"}, {"id": "266", "name": "лимон", "unit": "брой", "quantity": "1/2"}, {"id": "142", "name": "зехтин", "unit": "супени лъжици", "quantity": "2"}]', '[{"step": "1", "text": "Първа стъпка от рецептата за салата табуле с киноа е подготвянето на киноа. Киноа се вари в съотношение 1:3, като към врящата и подсолена вода се добавя предварително измитата киноа. Зрънцата киноа се сваряват бързо, приблизително за около 15-20 минути, когато са готови зрънцата стават прозрачни в средата, а около тях остават бели пръстенчета, които често се разкъсват."}, {"step": "2", "text": "Измивате магданоза и го нарязвате на дребно. Към него добавяте и дребно нарязаните домат и лук."}, {"step": "3", "text": "Смесвате сварената киноа и магданозената смес и овкусявате със сол, зехтин и сока на лимона."}]'],
            ['salata-tsezar', 'salata tsezar', 'Салата Цезар', '[{"id": "27", "name": "салата айсберг", "unit": "бр", "quantity": "1"}, {"id": "185", "name": "жълтъци", "unit": "бр", "quantity": "2"}, {"id": "63", "name": "горчица", "unit": "чаени лъжици", "quantity": "2"}, {"id": "28", "name": "аншоа", "unit": "филенца", "quantity": "4"}, {"id": "142", "name": "зехтин", "unit": "чаена чаша", "quantity": "2/3"}, {"id": "304", "name": "чесън", "unit": "скилидки", "quantity": "2"}, {"id": "138", "name": "оцет", "unit": "чаена лъжица", "quantity": "1"}, {"id": "29", "name": "филийки хляб", "unit": "бр", "quantity": "2"}, {"id": "117", "name": "пармезан", "unit": "гр", "quantity": "50"}, {"id": "121", "name": "пилешко месо", "unit": "гр", "quantity": "100"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за салата Цезар е подготовката на крутоните. Нарязвате багетата/хляба на едри кубчета, слагате ги в тава, посолявате ги, поръсвате с черен пипер и зехтин, разбърквате и печете в загрята на 200 градуса фурна за 8-10 минути, като разбърквате от време на време."}, {"step": "2", "text": "Докато крутоните се пекат с блендер разбйите всички съставки за соса - жълтъците, филетата аншоа, чесъна, зехтина, оцета и горчицата. Накъсвате салатата айсберг и изсипвате дресинга, след което разбърквате. По оригиналната рецепта салатата Цезар не се приготвя не със салата айсберг, а с маруля. Но тъй като марулята не се намира на пазара целогодишно, често приготвяме салатата Цезар със салата айсберг, защото е сочна и хрупкава по подобен начин."}, {"step": "3", "text": "Разбърквате добре салатата с дресинга, а след като крутоните се изпекат добавяте и тях.Салата Цезар с пиле:"}]'],
            
            ['ovcharska-salata', 'ovcharska salata', 'Овчарска салата', '[
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "98",
                    "name": " краставица",
                    "unit": "грама",
                    "quantity": "150"
                },
                {
                    "id": "96",
                    "name": " зелен пипер",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "152",
                    "name": " гъби",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "120"
                },
                {
                    "id": "409",
                    "name": " бекон",
                    "unit": "грама",
                    "quantity": "120"
                },
                {
                    "id": "262",
                    "name": " кашкавал",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "242",
                    "name": " варени яйца",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "36"
                },
                {
                    "id": "74",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "30"
                },
                {
                    "id": "479",
                    "name": " оцет",
                    "unit": "милилитра",
                    "quantity": "10"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "8",
                    "name": " маслини",
                    "unit": "грама",
                    "quantity": "10"
                }
            ]', '[]'],
            ['snezhanka', 'snezhanka', 'Снежанка', '[]', '[]'],
            ['grutska-salata', 'grutska salata', 'Гръцка салата', '[
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "98",
                    "name": " краставица",
                    "unit": "грама",
                    "quantity": "62"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "грама",
                    "quantity": "15"
                },
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "60"
                },
                {
                    "id": "96",
                    "name": " зелен пипер",
                    "unit": "грама",
                    "quantity": "15"
                },
                {
                    "id": "8",
                    "name": " маслини",
                    "unit": "грама",
                    "quantity": "15"
                },
                {
                    "id": "445",
                    "name": " зехтин",
                    "unit": "милилитра",
                    "quantity": "10"
                },
                {
                    "id": "214",
                    "name": " риган",
                    "unit": "грама",
                    "quantity": "2"
                }
            ]', '[]'],
            ['selska-salata', 'selska salata', 'Селска салата', '[
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "98",
                    "name": " краставица",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "104",
                    "name": " червен пипер",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "89",
                    "name": " червен лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "74",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "20"
                },
                {
                    "id": "479",
                    "name": " оцет",
                    "unit": "милилитра",
                    "quantity": "10"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "8",
                    "name": " маслини",
                    "unit": "броя",
                    "quantity": "1"
                }
            ]', '[]'],
            ['karakachanska-salata', 'karakachanska salata', 'Каракачанска салата', '[
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "104",
                    "name": " червен пипер",
                    "unit": "броя",
                    "quantity": "3"
                },
                {
                    "id": "89",
                    "name": " червен лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "250"
                },
                {
                    "id": "251",
                    "name": " кисело мляко",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "74",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "18"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],

            ['lyutenitsa', 'lyutenitsa', 'Лютеница', '[
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "грама",
                    "quantity": "7000"
                },
                {
                    "id": "104",
                    "name": " червен пипер",
                    "unit": "грама",
                    "quantity": "10000"
                },
                {
                    "id": "100",
                    "name": " патладжан",
                    "unit": "грама",
                    "quantity": "4000"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "180"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "45"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "206",
                    "name": " кимион",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "15"
                }
            ]', '[]'],
            ['kartofeno-pyure', 'kartofeno pyure', 'Картофено пюре', '[
                {
                    "id": "58",
                    "name": " картофи",
                    "unit": "грама",
                    "quantity": "400"
                },
                {
                    "id": "252",
                    "name": " прясно мляко",
                    "unit": "милилитра",
                    "quantity": "100"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],
            ['katuk', 'katuk', 'Катък', '[
                {
                    "id": "255",
                    "name": " цедено кисело мляко",
                    "unit": "грама",
                    "quantity": "250"
                },
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "104",
                    "name": " червен пипер",
                    "unit": "грама",
                    "quantity": "2"
                },
                {
                    "id": "165",
                    "name": " орехи",
                    "unit": "грама",
                    "quantity": "30"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "40"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "2"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],
            ['vareni-kartofi', 'vareni kartofi', 'Варени картофи', '[
                {
                    "id": "58",
                    "name": " картофи",
                    "unit": "грама",
                    "quantity": "1000"
                },
                {
                    "id": "204",
                    "name": " куркума",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "3"
                },
                {
                    "id": "85",
                    "name": " зелен лук",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "479",
                    "name": " оцет",
                    "unit": "милилитра",
                    "quantity": "10"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "50"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "209",
                    "name": " копър",
                    "unit": "връзка",
                    "quantity": "1"
                }
            ]', '[]'],
            
            ['pileshki-surtsa-v-maslo-na-tigan', 'pileshki surtsa v maslo na tigan', 'Пилешки сърца в масло на тиган', '[{"id": "100", "name": "пилешки сърца", "unit": "гр", "quantity": "500"}, {"id": "215", "name": "краве масло", "unit": "супени лъжици", "quantity": "3"}, {"id": "108", "name": "дафинов лист", "unit": "броя", "quantity": "2"}, {"id": "143", "name": "червен пипер", "unit": "чаена лъжица", "quantity": "1"}, {"id": "119", "name": "черен пипер", "unit": "чаена лъжица", "quantity": "1/2"}]', '[{"step": "1", "text": "Първата и най-важна стъпка е да подготвите пилешките сърца. Както е известно, сърцето е мускул, което пък означава, че не е много крехко, затова и задължително трябва да бъде подложено на предварителна обработка. Измивате добре пилешките сърца и ги варите заедно с дафиновия лист и ½ чаена лъжица сол около 30 минути, след което ги отцеждате добре. Най-добре е да ползва охладени сърца, а ако ползвате замразе задължително трябва да се размразят преди варене. В противен случай, че останат жилави."}, {"step": "2", "text": "В сгорещеното масло изсипвате отцедените пилешки сърца и ги задушавате за десетина минути. Накрая добавяте червения и черния пипер и задушавате за още около минута, като разбърквате добре, за да могат всички сърчица да се овкусят добре. Важно е да не пържите дълго сърцата след като добавите червения пипер, тъй като той бързо прегаря и придава нежелан горчив вкус."}]'],
            ['gubi-v-maslo', 'gubi v maslo', 'Гъби в масло', '[{"id": "114", "name": "печурки", "unit": "грама", "quantity": "500"}, {"id": "215", "name": "краве масло", "unit": "грама", "quantity": "50"}, {"id": "143", "name": "червен пипер", "unit": "чаена лъжица", "quantity": "1/2"}, {"id": "119", "name": "черен пипер", "unit": "чаена лъжица", "quantity": "1/4"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за гъби в масло е подготовката на гъбите. Измивате гъбите и ги нарязвате на едри парчета. Ако гъбите са съвсем пресни може да ползвате и пънчетата, в противен случай не ги използвайте."}, {"step": "2", "text": "В тиган разтопете маслото, добавете гъбите и посолете с около ½ чаена лъжица сол. Разбъркайте добре и задушете, докато гъбите намалят два пъти обема си. Добавете червения и черния пипер и разбърквате, като оставяте гъбите на котлона за още 2-3 минути."}]'],

            ['kartofi-sote', 'kartofi sote', 'Картофи соте', '[
                {
                    "id": "58",
                    "name": " картофи",
                    "unit": "грама",
                    "quantity": "1000"
                },
                {
                    "id": "209",
                    "name": " копър",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "3"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "30"
                }
            ]', '[]'],
            ['spanacheni-kyufteta', 'spanacheni kyufteta', 'Спаначени кюфтета', '[
                {
                    "id": "80",
                    "name": " спанак",
                    "unit": "грама",
                    "quantity": "1000"
                },
                {
                    "id": "58",
                    "name": " картофи",
                    "unit": "броя",
                    "quantity": "5"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "50"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "20"
                },
                {
                    "id": "74",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "223",
                    "name": " червен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "459",
                    "name": " галета",
                    "unit": "грама",
                    "quantity": "100"
                }
            ]', '[]'],
            ['panirani-kashkavalcheta', 'panirani kashkavalcheta', 'Панирани кашкавалчета', '[
                {
                    "id": "262",
                    "name": " кашкавал",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "459",
                    "name": " галета",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "200"
                }
            ]', '[]'],
            ['sirene-pane', 'sirene pane', 'Сирене пане', '[
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "459",
                    "name": " галета",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "30"
                },
                {
                    "id": "223",
                    "name": " червен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "30"
                }
            ]', '[]'],
            ['omlet', 'omlet', 'Омлет', '[
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "262",
                    "name": " кашкавал",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "74",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "10"
                }
            ]', '[]'],
            ['spanacheni-kyuftentsa-s-mlechen-chesnov-sos', 'spanacheni kyuftentsa s mlechen chesnov sos', 'Спаначени кюфтенца с млечен чеснов сос', '[
                {
                    "id": "80",
                    "name": " спанак",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "459",
                    "name": " галета",
                    "unit": "грама",
                    "quantity": "250"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "2"
                },
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "209",
                    "name": " копър",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "251",
                    "name": " кисело мляко",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "244",
                    "name": " майонеза",
                    "unit": "грама",
                    "quantity": "50"
                }
            ]', '[]'],
            ['selski-kartofi', 'selski kartofi', 'Селски картофи', '[
                {
                    "id": "58",
                    "name": " картофи",
                    "unit": "грама",
                    "quantity": "1000"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "3"
                },
                {
                    "id": "204",
                    "name": " куркума",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "223",
                    "name": " червен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "224",
                    "name": " червен лют пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "445",
                    "name": " зехтин",
                    "unit": "милилитра",
                    "quantity": "30"
                },
                {
                    "id": "233",
                    "name": " мащерка",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],
            ['postni-lozovi-sarmichki-s-mlechen-sos', 'postni lozovi sarmichki s mlechen sos', 'Постни лозови сармички с млечен сос', '[
                {
                    "id": "470",
                    "name": " лозови листа",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "50",
                    "name": " моркови",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "139",
                    "name": " ориз",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "223",
                    "name": " червен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "225",
                    "name": " чубрица",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "20"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "251",
                    "name": " кисело мляко",
                    "unit": "грама",
                    "quantity": "400"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "20"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],
            ['rulo-stefani-s-kartofeno-pyure', 'rulo stefani s kartofeno pyure', 'Руло Стефани с картофено пюре', '[
                {
                    "id": "374",
                    "name": " кайма",
                    "unit": "грама",
                    "quantity": "1000"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "459",
                    "name": " галета",
                    "unit": "грама",
                    "quantity": "80"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "225",
                    "name": " чубрица",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "74",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "20"
                },
                {
                    "id": "262",
                    "name": " кашкавал",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "97",
                    "name": " корнишон",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "50",
                    "name": " моркови",
                    "unit": "броя",
                    "quantity": "2"
                }
            ]', '[]'],
            ['pulneni-piperki-s-oriz', 'pulneni piperki s oriz', 'Пълнени пиперки с ориз', '[
                {
                    "id": "104",
                    "name": " червен пипер",
                    "unit": "броя",
                    "quantity": "10"
                },
                {
                    "id": "139",
                    "name": " ориз",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "87",
                    "name": " праз",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "4"
                },
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "броя",
                    "quantity": "4"
                },
                {
                    "id": "197",
                    "name": " дафинов лист",
                    "unit": "броя",
                    "quantity": "3"
                },
                {
                    "id": "223",
                    "name": " червен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "45"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "20"
                }
            ]', '[]'],
            ['kartofeni-kyuftentsa', 'kartofeni kyuftentsa', 'Картофени кюфтенца', '[
                {
                    "id": "58",
                    "name": " картофи",
                    "unit": "грама",
                    "quantity": "1000"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "4"
                },
                {
                    "id": "459",
                    "name": " галета",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "2"
                },
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "10"
                }
            ]', '[]'],
            ['ogreten', 'ogreten', 'Огретен', '[
                {
                    "id": "58",
                    "name": " картофи",
                    "unit": "грама",
                    "quantity": "1000"
                },
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "74",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "252",
                    "name": " прясно мляко",
                    "unit": "милилитра",
                    "quantity": "300"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "3"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "459",
                    "name": " галета",
                    "unit": "грама",
                    "quantity": "30"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "50"
                }
            ]', '[]'],
            ['chushki-byurek-s-mlechen-sos', 'chushki byurek s mlechen sos', 'Чушки бюрек с млечен сос', '[
                {
                    "id": "104",
                    "name": " червен пипер",
                    "unit": "броя",
                    "quantity": "10"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "250"
                },
                {
                    "id": "252",
                    "name": " прясно мляко",
                    "unit": "милилитра",
                    "quantity": "50"
                },
                {
                    "id": "87",
                    "name": " праз",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "20"
                },
                {
                    "id": "251",
                    "name": " кисело мляко",
                    "unit": "грама",
                    "quantity": "400"
                },
                {
                    "id": "209",
                    "name": " копър",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "10"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "10"
                }
            ]', '[]'],
            ['zapecheno-koze-sirene-s-med-i-orehi', 'zapecheno koze sirene s med i orehi', 'Запечено козе сирене с мед и орехи', '[
                {
                    "id": "266",
                    "name": " сирене",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "10"
                },
                {
                    "id": "440",
                    "name": " пчелен мед",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "165",
                    "name": " орехи",
                    "unit": "грама",
                    "quantity": "20"
                }
            ]', '[]'],
            ['tarama-haiver', 'tarama haiver', 'Тарама хайвер', '[
                {
                    "id": "319",
                    "name": " разбит хайвер",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "750"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "15"
                },
                {
                    "id": "495",
                    "name": " хляб",
                    "unit": "грама",
                    "quantity": "700"
                },
                {
                    "id": "32",
                    "name": " лимон",
                    "unit": "броя",
                    "quantity": "1"
                }
            ]', '[]'],
            ['bob-po-manastirski', 'bob po manastirski', 'Боб по манастирски', '[
                {
                    "id": "133",
                    "name": " фасул",
                    "unit": "грама",
                    "quantity": "300"
                },
                {
                    "id": "211",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "198",
                    "name": " джоджен",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "81",
                    "name": " целина",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "50"
                },
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "50",
                    "name": " моркови",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],
            
            ['kashkaval-pane', 'kashkaval pane', 'Кашкавал пане', '[{"id": "126", "name": "кашкавал", "unit": "грама", "quantity": "400"}, {"id": "213", "name": "яйца", "unit": "брой", "quantity": "1"}, {"id": "222", "name": "бяло брашно", "unit": "супени лъжици", "quantity": "4"}, {"id": "57", "name": "галета", "unit": "супени лъжици", "quantity": "4"}, {"id": "224", "name": "олио", "unit": "мл", "quantity": "150"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за кашкавал пане е подготовката на кашкавала. Нарежете кашкавала на правоъгълни или триъгълни парчета с дебелина около 1 сантиметър. Кашкавалът сложете в купа със студена вода. Изберете стегнат и твърд кашкавал, какъвто е кашкавалът на Мандра Киселово, тъй като мекият кашкавал бе се разтекъл по време на пържене."}, {"step": "2", "text": "В три отделни чинии сложете брашното, разбитото яйце и галетата. В тиган сгорещете мазнината. Всяко парче кашкавал овалвате добре в брашно, след това в разбитото яйце, а накрая и в галета и пържите в добре сгорещеното олио за около минута от всяка страна, или докато придобият златист цвят."}]'],
            ['bob-yahniya', 'bob yahniya', 'Боб яхния', '[{"id": "14", "name": "фасул", "unit": "чаени чаши", "quantity": "2"}, {"id": "272", "name": "моркови", "unit": "броя", "quantity": "2"}, {"id": "267", "name": "лук", "unit": "глава", "quantity": "1"}, {"id": "304", "name": "чесън", "unit": "скилидки", "quantity": "4"}, {"id": "224", "name": "олио", "unit": "чаена чаша", "quantity": "1/2"}, {"id": "143", "name": "червен пипер", "unit": "чаени лъжици", "quantity": "2"}, {"id": "103", "name": "джоджен", "unit": "чаена лъжица", "quantity": "1"}, {"id": "146", "name": "домати", "unit": "броя", "quantity": "2"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за боб яхния е подготовката на боба. Накиснете боба в студена вода за няколко часа, може и от вечерта. Излейте водата, в която се е киснал, налейте друга и сложете на котлона. След като бобът заври излейте водата и налейте нова. Може да смените водата на боба още веднъж. Във всяка къща има тайни и традиции какво да направим, за да се свари бобът по-бързо и за да бъде по-лек. Някои слагат ракия при варенето, други път сода за хляб. Истината е, че смяната на водата е напълно достатъчна. Иначе всичко зависи от сорта и качеството на боба. След като смените водата налейте толкова вода, че да покрие боба с един пръст и сложете на котлона. Не слагате сол!"}, {"step": "2", "text": "Почистете и нарежете на дребно лука и морковите и добавете половината от тях към врящия боб. Добавете и скилидките чесън, джоджена, както и половината олио. Оставете боба да ври на слаб огън до пълно сваряване. Времето необходимо за сваряване на боба зависи от сорта и качеството му, но около час и половина трябва да е достатъчно. След като бобът е почти готов добавете, измитите, обелени и нарязани на ситно домати, както и сол, около 1 чаена лъжица трябва да е достатъчно."}, {"step": "3", "text": "Идва моментът, в който трябва да запържим боба. В тиган изсипете останалото олио, и след като се сгорещи останалата половина от нарязаните лук и моркови. Добавете и червения пипер, разбъркайте за около 20-30 секунди, след което запръжката в тенджера с боб и разбъркайте добре. Оставете да заври за около минута."}]'],
            ['yaitsa-po-panagyurski', 'yaitsa po panagyurski', 'Яйца по панагюрски', '[{"id": "213", "name": "яйца", "unit": "броя", "quantity": "8"}, {"id": "163", "name": "кисело мляко", "unit": "грама", "quantity": "400"}, {"id": "131", "name": "сирене", "unit": "грама", "quantity": "100"}, {"id": "215", "name": "краве масло", "unit": "грама", "quantity": "20"}, {"id": "143", "name": "червен пипер", "unit": "чаена лъжица", "quantity": "1/2"}, {"id": "304", "name": "чесън", "unit": "скилидки", "quantity": "2"}]', '[{"step": "1", "text": "Първо пригответе основата за всяка порция яйца по панагюрски. Натрошете сиренето и го разбъркайте с киселото мляко. Ако обичате чесън нарежете 2-3 скилидки на ситни парченца и ги добавете към сместа от кисело мляко и сирене. Получената смес разпределете в дълбоки чинии."}, {"step": "2", "text": "В голяма тенджера сипвате вода и я слагате да заври. След като заври добавяте 1 чаена лъжица оцет и ½ чаена лъжица сол. Дърпате тенджерата от котлона и от ниско чуквате яйцата едно по едно. Връщате тенджерата с яйцата на котлона и оставяте да поврят 2-3 минути, ако обичате рохки яйца, или 5 минути, яко предпочитате вашите яйца по панагюрски да са по-твърди. Яйцата трябва да се забулят. Когато яйцата са готови ги извадете с решетъчна лъжица и поставете по две във всяка чиния."}, {"step": "3", "text": "В тиган разтопете маслото, след което добавете червения пипер и разбъркайте за 20-30 секунди. Внимавайте пиперът да не загори, защото това ще развали вкуса на вашите яйца по панагюрски!  Добавете от запържения червен пипер във всяка порция."}]'],
            
            ['yaitse-na-ochi', 'yaitse na ochi', 'Яйце на очи', '[]', '[]'],
            ['mish-mash', 'mish mash', 'Миш Маш', '[]', '[]'],
            ['burkani-yaitsa', 'burkani yaitsa', 'Бъркани яйца', '[]', '[]'],
            ['pileshki-drobcheta', 'pileshki drobcheta', 'Пилешки дробчета', '[]', '[]'],
            ['pileshki-vodenichki', 'pileshki vodenichki', 'Пилешки воденички', '[]', '[]'],
            ['pileshki-hapki-pane', 'pileshki hapki pane', 'Пилешки хапки пане', '[]', '[]'],
            ['pileshki-shashlik', 'pileshki shashlik', 'Пилешки шашлик', '[]', '[]'],
            ['pileshka-purzhola', 'pileshka purzhola', 'Пилешка пържола', '[]', '[]'],
            ['pileshko-file', 'pileshko file', 'Пилешко филе', '[]', '[]'],
            ['pileshko-shishche', 'pileshko shishche', 'Пилешко шишче', '[]', '[]'],
            ['pileshka-kavurma', 'pileshka kavurma', 'Пилешка кавърма', '[]', '[]'],
            ['svinska-kavurma', 'svinska kavurma', 'Свинска кавърма', '[]', '[]'],
            ['svinsko-shishche', 'svinsko shishche', 'Свинско шишче', '[]', '[]'],
            ['svinski-rebra', 'svinski rebra', 'Свински ребра', '[]', '[]'],
            ['svinska-vratna-purzhola-bez-kost', 'svinska vratna purzhola bez kost', 'Свинска вратна пържола без кост', '[]', '[]'],
            ['svinsko-bon-file', 'svinsko bon file', 'Свинско бон филе', '[]', '[]'],
            ['svinski-karentsa', 'svinski karentsa', 'Свински каренца', '[]', '[]'],
            ['teleshka-kavurma', 'teleshka kavurma', 'Телешка кавърма', '[]', '[]'],
            ['vodenichki-s-luk', 'vodenichki s luk', 'Воденички с лук', '[]', '[]'],
            ['surtsa-s-luk', 'surtsa s luk', 'Сърца с лук', '[]', '[]'],
            ['tatarsko-kyufte', 'tatarsko kyufte', 'Татарско кюфте', '[]', '[]'],
            ['bolyarsko-kyufte', 'bolyarsko kyufte', 'Болярско кюфте', '[]', '[]'],
            ['karakachansko-kyufte', 'karakachansko kyufte', 'Каракачанско кюфте', '[]', '[]'],
            ['teleshki-domashni-kyuftentsa', 'teleshki domashni kyuftentsa', 'Телешки домашни кюфтенца', '[]', '[]'],
            ['haidushki-shashlik', 'haidushki shashlik', 'Хайдушки шашлик', '[]', '[]'],
            ['pateshko-magre', 'pateshko magre', 'Патешко магре', '[]', '[]'],
            ['teleshki-stek', 'teleshki stek', 'Телешки стек', '[]', '[]'],
            ['zaek-po-lovdzhiiski', 'zaek po lovdzhiiski', 'Заек по ловджийски', '[]', '[]'],
            ['vienski-shnitsel', 'vienski shnitsel', 'Виенски шницел', '[]', '[]'],
            ['teleshki-kyufteta', 'teleshki kyufteta', 'Телешки кюфтета', '[]', '[]'],
            ['teleshko-vareno', 'teleshko vareno', 'Телешко варено', '[{"id": "1", "name": "телешки джолан", "unit": "брой", "quantity": "1"}, {"id": "255", "name": "картофи", "unit": "грама", "quantity": "300"}, {"id": "272", "name": "моркови", "unit": "грама", "quantity": "300"}, {"id": "301", "name": "целина", "unit": "грама", "quantity": "150"}, {"id": "146", "name": "домати", "unit": "грама", "quantity": "200"}, {"id": "267", "name": "лук", "unit": "грама", "quantity": "300"}, {"id": "215", "name": "краве масло", "unit": "грама", "quantity": "40"}, {"id": "119", "name": "черен пипер", "unit": "зърна", "quantity": "10"}, {"id": "138", "name": "оцет", "unit": "супена лъжица", "quantity": "1"}, {"id": "104", "name": "магданоз", "unit": "връзка", "quantity": "1"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за телешко варено е подготовката на джолана. Измивате добре телешкия джолан и го слагате в голяма тенджера  със студена вода и го слагате на котлона да заври. След като водата заври се образува пяна, отстранявате пяната, прецеждате бульона, след което връщате супата на котлона. Добавяте оцета, около 1 ½ чаена лъжица сол  и черен пипер и оставяте джолана да ври до пълно сваряване. По време на варенето следете водата да е над джолана и ако се наложи доливайте."}, {"step": "2", "text": "Докато джоланът ври, почистете картофите, морковите, лука и целината. Използвайте по-малки картофи и лук, оставете ги цели, а ако имате по-едри, то ги нарежете на големи парчета.Доматите също трябва да са цели. Морковите и целината също нарежете на едри парчета. След като джоланът е сварен го извадете от супата и го обезкостете. Обезкостеното месо, заедно със зеленчуците върнете обратно в бульона и варете до сваряване на зеленчуците."}, {"step": "3", "text": "Поднасяте супата гореща, като към всяка купичка добавяте нарязан пресен магданоз и бучка краве масло."}]'],
            ['kyufteta-po-chirpanski', 'kyufteta po chirpanski', 'Кюфтета по чирпански', '[]', '[]'],
            ['vinen-kebap', 'vinen kebap', 'Винен кебап', '[]', '[]'],
            ['pile-zhulien', 'pile zhulien', 'Пиле Жулиен', '[]', '[]'],
            ['pusturva', 'pusturva', 'Пъстърва', '[]', '[]'],
            ['som', 'som', 'Сом', '[]', '[]'],
            ['byala-riba', 'byala riba', 'Бяла риба', '[]', '[]'],
            ['amur', 'amur', 'Амур', '[]', '[]'],
            ['sharan', 'sharan', 'Шаран', '[]', '[]'],
            ['skumriya-na-skara', 'skumriya na skara', 'Скумрия на скара', '[]', '[]'],
            ['tsipura-na-skara', 'tsipura na skara', 'Ципура на скара', '[]', '[]'],
            ['hek-pane', 'hek pane', 'Хек пане', '[]', '[]'],
            ['lavrak', 'lavrak', 'Лаврак', '[]', '[]'],
            ['spageti-karbonara', 'spageti karbonara', 'Спагети Карбонара', '[
                {
                    "id": "483",
                    "name": " спагети",
                    "unit": "грама",
                    "quantity": "300"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "409",
                    "name": " бекон",
                    "unit": "грама",
                    "quantity": "150"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "10"
                },
                {
                    "id": "243",
                    "name": " жълтъци",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "249",
                    "name": " готварска сметана",
                    "unit": "милилитра",
                    "quantity": "100"
                },
                {
                    "id": "265",
                    "name": " пармезан",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "222",
                    "name": " черен пипер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "195",
                    "name": " босилек",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],
            ['spageti-boloneze', 'spageti boloneze', 'Спагети Болонезе', '[
                {
                    "id": "483",
                    "name": " спагети",
                    "unit": "грама",
                    "quantity": "400"
                },
                {
                    "id": "214",
                    "name": " риган",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "445",
                    "name": " зехтин",
                    "unit": "милилитра",
                    "quantity": "30"
                },
                {
                    "id": "437",
                    "name": " червено вино",
                    "unit": "милилитра",
                    "quantity": "300"
                },
                {
                    "id": "95",
                    "name": " домати",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "5"
                },
                {
                    "id": "50",
                    "name": " моркови",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "81",
                    "name": " целина",
                    "unit": "връзка",
                    "quantity": "1"
                },
                {
                    "id": "86",
                    "name": " лук",
                    "unit": "глави",
                    "quantity": "1"
                },
                {
                    "id": "374",
                    "name": " кайма",
                    "unit": "грама",
                    "quantity": "400"
                },
                {
                    "id": "74",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "10"
                }
            ]', '[]'],
            ['teliateli', 'teliateli', 'Телиатели', '[]', '[]'],
            ['margarita', 'margarita', 'Маргарита', '[]', '[]'],
            ['kaprichoza', 'kaprichoza', 'Капричоза', '[]', '[]'],
            ['kaltsone', 'kaltsone', 'Калцоне', '[]', '[]'],
            ['peperoni', 'peperoni', 'Пеперони', '[]', '[]'],
            ['kuatro-formadzhi', 'kuatro formadzhi', 'Куатро Формаджи', '[]', '[]'],
            ['dyavola', 'dyavola', 'Дявола', '[]', '[]'],
            ['chetiri-sirena', 'chetiri sirena', 'Четири сирена', '[]', '[]'],
            ['chetiri-sezona', 'chetiri sezona', 'Четири сезона', '[]', '[]'],
            ['kuatro-di-karne', 'kuatro di karne', 'Куатро ди Карне', '[]', '[]'],
            
            ['fokacha-s-chesun-rozmarin-i-morska-sol', 'fokacha s chesun, rozmarin i morska sol', 'Фокача с чесън, розмарин и морска сол', '[{"id": "222", "name": "бяло брашно", "unit": "грама", "quantity": "500"}, {"id": "141", "name": "мая", "unit": "кубче", "quantity": "1/2"}, {"id": "223", "name": "захар", "unit": "чаена лъжица", "quantity": "1/2"}, {"id": "227", "name": "сол", "unit": "чаена лъжица", "quantity": "1"}, {"id": "195", "name": "вода", "unit": "мл", "quantity": "300"}, {"id": "304", "name": "чесън", "unit": "скилидки", "quantity": "4"}, {"id": "287", "name": "розмарин", "unit": "чаена лъжица", "quantity": "1"}, {"id": "142", "name": "зехтин", "unit": "супени лъжици", "quantity": "4"}, {"id": "124", "name": "морска сол", "unit": "чаена лъжица", "quantity": "1"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за фокача с чесън, розмарин и морска сол е подготовката на маята. В хладка вода добавяте ½ кубче прясна мая Виво, добавяте  захарта, разбърквате добре и оставяте на страна, за да се надигне и да се получи квас. Междувременно пресявате в купа подготвеното брашно, добавяте към него и солта. "}, {"step": "2", "text": "Когато сместа с маята е готова, правите в брашното кладенче изсипвате маята и замесвате тесто от съставките. месите около 5-10 минути, намазвате със зехтин и оставяте в намазнена купа да втаса докато удвои обема си. След като тестото за фокача втаса веднъж се премесва втори път и отново се оставя да втаса."}, {"step": "3", "text": "Когато тестото втаса за втори път намажете тава обилно със зехтин, като предварително може да поставите и хартия за печене върху нея. Може да ползвате тавата на фурната, както е приготвена и фокачата на снимките. Разстелете тестото в тавата. Междувременно счукайте чесъна и в малка купичка или чаша го разбърквате с останалия зехтин. Намажете тестото за фокача обилно със сместа, поръсете с морска сол и предвиденото количество розмарин."}]'],
            ['palachinki', 'palachinki', 'Палачинки', '[{"id": "222", "name": "бяло брашно", "unit": "чаени чаши", "quantity": "2"}, {"id": "195", "name": "вода", "unit": "чаена чаша", "quantity": "1"}, {"id": "214", "name": "прясно мляко", "unit": "чаени чаши", "quantity": "2"}, {"id": "213", "name": "яйца", "unit": "броя", "quantity": "3"}, {"id": "227", "name": "сол", "unit": "чаена лъжица", "quantity": "1/2"}, {"id": "223", "name": "захар", "unit": "супена лъжица", "quantity": "1"}, {"id": "215", "name": "краве масло", "unit": "супена лъжица", "quantity": "1"}]', '[{"step": "1", "text": "Първо трябва да разбиете яйцата и захарта. Най-добре е да направите това с миксер, защото ще стане много по-лесно и много по-бързо, но ако нямате миксер под ръка не е проблем да разбиете съставките и с вилица. Към разбитите яйца и захар добавете водата, а след това малко по малко и брашното. За приготвянето на палачинки не е необходимо да пресявате брашното, но все пак трябва да го добавяте постепенно, за да не станат вашите палачинки на бучки. Накрая добавяте млякото и солта и отново разбърквате добре."}, {"step": "2", "text": "За пърженето на палачинки е най-добре да имате специален плосък тиган – специален тиган за палачинки. Специалното на този тиган е това, че в него палачинките се обръщат много по-лесно, а и сместа се разпределя по-равномерно. Ако обаче нямате такъв тиган ползвайте вашия малък универсален тиган. Загрейте го и го намажете с бучка от маслото, с големина на грахово зърно. Можете да ползвате и олио, но в такъв случай вашите палачинки няма да станат така ароматни."}]'],

            ['chesnovo-hlebche', 'chesnovo hlebche', 'Чесново хлебче', '[
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "251",
                    "name": " кисело мляко",
                    "unit": "грама",
                    "quantity": "400"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "15"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "473",
                    "name": " мая",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "217",
                    "name": " сода бикарбонат",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "25"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "милилитра",
                    "quantity": "75"
                },
                {
                    "id": "90",
                    "name": " чесън",
                    "unit": "скилидки",
                    "quantity": "5"
                },
                {
                    "id": "211",
                    "name": " магданоз",
                    "unit": "грама",
                    "quantity": "15"
                }
            ]', '[]'],
            ['arabsko-hlebche', 'arabsko hlebche', 'Арабско хлебче', '[
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "300"
                },
                {
                    "id": "488",
                    "name": " суха мая",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "429",
                    "name": " вода",
                    "unit": "милилитра",
                    "quantity": "200"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "445",
                    "name": " зехтин",
                    "unit": "милилитра",
                    "quantity": "20"
                }
            ]', '[]'],
            ['chiabata', 'chiabata', 'Чиабата', '[
                {
                    "id": "488",
                    "name": " суха мая",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "429",
                    "name": " вода",
                    "unit": "милилитра",
                    "quantity": "200"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "250"
                },
                {
                    "id": "488",
                    "name": " суха мая",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "216",
                    "name": " сол",
                    "unit": "грама",
                    "quantity": "15"
                },
                {
                    "id": "429",
                    "name": " вода",
                    "unit": "милилитра",
                    "quantity": "300"
                },
                {
                    "id": "252",
                    "name": " прясно мляко",
                    "unit": "милилитра",
                    "quantity": "80"
                },
                {
                    "id": "445",
                    "name": " зехтин",
                    "unit": "милилитра",
                    "quantity": "10"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "500"
                }
            ]', '[]'],
            
            ['shokoladov-chiizkeik', 'shokoladov chiizkeik', 'Шоколадов чийзкейк', '[{"id": "164", "name": "обикновени бисквити", "unit": "грама", "quantity": "200"}, {"id": "206", "name": "какао", "unit": "супени лъжици", "quantity": "2"}, {"id": "215", "name": "краве масло", "unit": "грама", "quantity": "125"}, {"id": "149", "name": "крем сирене", "unit": "грама", "quantity": "600"}, {"id": "223", "name": "захар", "unit": "чаена чаша", "quantity": "2/3"}, {"id": "213", "name": "яйца", "unit": "броя", "quantity": "4"}, {"id": "225", "name": "ванилии", "unit": "броя", "quantity": "2"}, {"id": "165", "name": "шоколад", "unit": "грама", "quantity": "200"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за шоколадов чийзкейк е подготовката на блата. Смилате бисквитите или ги счуквате. Добавяте към бисквитите какаото и разбърквате добре. Добавяте и кравете масло, което и било на стайна температура и омесвате сместа. На дъното на форма за печене с падащи стени, или в избраната от вас форма за печене, поставяте хартия за печене, изрязана според размера на тавата. Върху хартията за печене разпределяте сместа, като я притискате с ръце плътно по дъното."}, {"step": "2", "text": "Докато приготвяте блата, начупете шоколада на парченца, сложете го в малка купичка, а нея - в тенджера с вода на котлона и го разтопете на водна баня. Добре е да ползвате черен шоколад, или шоколад за готварски цели. В голяма купа разбийте добре с миксер или тел за разбиване крем сиренето. Добавете захарта и разбивайте около 2-3 минути, за да се разтопи захарта, след което едно по едно, при непрекъснато разбиване добавете и яйцата, както и ванилията. Накрая добавете и разтопения шоколад и разбъркайте добре, за да стане сместа хомогенна."}, {"step": "3", "text": "Върху блата изсипете сместа и печете в предварително загрята на 150 градуса фурна за 90 минути. След като шоколадовият чийзкейк се изпече, изключете фурната и го оставете за около 10-15 минути във фурната, като вратата ѝ е отворена. Извадете от фурната и го оставете да изстине напълно. Съхранявайте шоколадовия чийзкейк в хладилник."}]'],
            ['mlyako-s-oriz', 'mlyako s oriz / sutlyash', 'Мляко с ориз / Сутляш', '[{"id": "214", "name": "прясно мляко", "unit": "литър", "quantity": "1"}, {"id": "276", "name": "ориз", "unit": "кафени чаши", "quantity": "2"}, {"id": "195", "name": "вода", "unit": "чаена чаша", "quantity": "1"}, {"id": "158", "name": "ванилия", "unit": "брой", "quantity": "1"}, {"id": "228", "name": "канела", "unit": "чаена лъжица", "quantity": "1"}, {"id": "154", "name": "сладко", "unit": "супени лъжици", "quantity": "3"}, {"id": "223", "name": "захар", "unit": "чаена чаша", "quantity": "1"}]', '[{"step": "1", "text": "Почиствате и измивате ориза и го слагате да ври в тенджера в приготвеното количество вода (1 чаена чаша). Най-подходящият сорт ориз за този десерт е бял бисерен ориз. Можете да приготвите мляко с ориз и с друг вид ориз, но тогава няма да получите познатия от детството десерт. Оризът ври, до полуомекване и попиване на водата."}, {"step": "2", "text": "Към ориза добавяте млякото и варите до пълното сваряване на ориза. След като оризът е сварен  сваляте тенджерата от котлона и добавяте захарта, след което връщате ориза отново на котлона. След като млякото с ориз заври отново добавяте ванилията и го сваляте от огъня."}, {"step": "3", "text": "Готовият десерт разпределете в купички, или чаши докато е още горещ. Преди сервиране може да поръсите с канела. Друг вариант за сервиране, популярен в Германия например, е поднасянето на млякото с ориз с добавка лъжичка-две сладко от малини, или сладко от ягоди."}]'],
            ['biskvitena-torta', 'biskvitena torta', 'Бисквитена торта', '[{"id": "164", "name": "обикновени бисквити", "unit": "грама", "quantity": "200"}, {"id": "214", "name": "прясно мляко", "unit": "л", "quantity": "1"}, {"id": "185", "name": "жълтъци", "unit": "броя", "quantity": "3"}, {"id": "222", "name": "бяло брашно", "unit": "супени лъжици", "quantity": "4"}, {"id": "223", "name": "захар", "unit": "чаена чаша", "quantity": "1"}, {"id": "215", "name": "краве масло", "unit": "грама", "quantity": "40"}, {"id": "158", "name": "ванилия", "unit": "броя", "quantity": "2"}]', '[{"step": "1", "text": "Традиционно бисквитената торта се приготвя с готови кремчета нишесте, но ако съберете малко смелост да приготвите домашен крем вашата бисквитена торта ще стане много по-вкусна. Нужна е наистина смелост, а не повече време или пък повече умения, защото кремът за бисквитена торта се приготвя наистина много лесно.Отделяте 100 мл студено прясно мляко, а останалото слагате да заври. Междувременно отделяте жълтъците от белтъците, след което разбивате жълтъците - най-добре с миксер или тел за разбиване, добавяте и останалото студено прясно мляко. Към тях добавяте малко по малко брашното при непрекъснато бъркане, за да не става на бучки, бъркате до получаване на гладка каша.Белтъци, които остават, може да ползвате за приготвянето на целувки или пък за някоя глазура."}, {"step": "2", "text": "Към свареното мляко добавяте маслото, ванилията и захарта, докато млякото е още топло, след което го връщате на котлона. Малко по малко при непрекъснато бъркане добавяте сместа с жълтъците. Кремът за бисквитената торта се сгъстява бързо, затова е необходимо непрекъснато бъркане, за да не загори. След като кремът поври 3-4 минути го сваляте от котлона."}, {"step": "3", "text": "Идва моментът, в който да подредите бисквитената торта. На дъното на съд, който най-добре да е с правоъгълна форма, изсипвате с черпак за супа малко от крема. Върху него плътно нареждате от бисквитите, които заливате отново с крем. Повтаряте процедурата, докато бисквитите и крема свършат, като завършвате бисквитената торта с крем. Може да я украсите с начупени сурови ядки или да я поръсите с какао."}]'],
            ['krem-karamel', 'krem karamel', 'Крем карамел', '[{"id": "214", "name": "прясно мляко", "unit": "мл", "quantity": "500"}, {"id": "213", "name": "яйца", "unit": "броя", "quantity": "4"}, {"id": "223", "name": "захар", "unit": "чаена чаша", "quantity": "1/2"}, {"id": "225", "name": "ванилии", "unit": "броя", "quantity": "2"}, {"id": "223", "name": "захар", "unit": "супени лъжици", "quantity": "6"}, {"id": "182", "name": "лимонов сок", "unit": "супена лъжица", "quantity": "1"}, {"id": "195", "name": "вода", "unit": "супена лъжица", "quantity": "1"}]', '[{"step": "1", "text": "Извадете яйцата и прясното мляко от хладилника предварително, за да постоят известно време на стайна температура. Разбивате добре яйцата със захарта, след което добавяте и прясното и мляко и отново разбивате до пълно разтопяване на захарта."}, {"step": "2", "text": "Отделно в малка тенджера приготвяте карамела за крем карамела. Слагате тенджерата, в коятао сте смесили захарта, водата и лимоновия сок, да заври на котлона, като междувременно бъркате непрекъснато. Бъркате карамелената смес докато придобие златист цвят, след което го сваляте от огъня и го разпределяте в купичките с помощта на лъжица. Пълните купичките с яйчената смес."}, {"step": "3", "text": "И тук идва моментът, който плаши всеки начинаещ кулинар – печенето! Печете крем карамелът на водна баня в предварително загрята на 150 градуса фурна. Печене на водна баня означава да поставите купичките в съд пълен с вода и така да го поставите във фурната. Важно е водата да бъде до ръба на купичките, т.е. дотам, докъдето са пълни купичките със смес. Трябва да следите процеса на печене на крем карамела отблизо, защото е много важно водата да не завира. Ако водата ври по време на печенето, вашият крем карамел ще стане на шупли.В случай, че водата започне да завира допълнете със студена вода и намалете малко градусите на фурната. След около час крем карамелът трябва да е придобил апетитна коричка и да е готов."}]'],
            ['plodova-salata', 'plodova salata', 'Плодова салата', '[{"id": "221", "name": "банан", "unit": "брой", "quantity": "1"}, {"id": "230", "name": "ананас", "unit": "брой", "quantity": "1/4"}, {"id": "270", "name": "манго", "unit": "брой", "quantity": "1/2"}, {"id": "169", "name": "киви", "unit": "броя", "quantity": "2"}, {"id": "170", "name": "портокали", "unit": "брой", "quantity": "1"}, {"id": "216", "name": "мед", "unit": "супена лъжица", "quantity": "1"}, {"id": "211", "name": "ром", "unit": "супени лъжици", "quantity": "2"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за плодова салата е подготовката на плодовете. Обелвате плодовете, без портокала и ги нарязвате на еднакви дребни парченца и ги разпределяте в купички или чаши."}, {"step": "2", "text": "Изцеждате сока на портокала, добавяте меда и рома и разбърквате добре, докато меда се разтопи напълно. Полейте нарязаните плодове с получения меден сос. Преди сервиране поръсете всяка чаша с натрошени сурови ядки или пък с домашна гранола например."}]'],
            ['pechena-tikva', 'pechena tikva', 'Печена тиква', '[{"id": "294", "name": "тиква", "unit": "грама", "quantity": "500"}, {"id": "207", "name": "сурови бадеми", "unit": "кафена чаша", "quantity": "1"}, {"id": "208", "name": "сурови лешници", "unit": "кафена чаша", "quantity": "1/2"}, {"id": "209", "name": "стафиди", "unit": "кафена чаша", "quantity": "1/2"}, {"id": "210", "name": "сушени кайсии", "unit": "кафена чаша", "quantity": "1/2"}, {"id": "223", "name": "захар", "unit": "кафена чаша", "quantity": "1/2"}, {"id": "211", "name": "ром", "unit": "кафена чаша", "quantity": "1/2"}, {"id": "228", "name": "канела", "unit": "пръчки", "quantity": "5"}, {"id": "212", "name": "карамфил", "unit": "цветчета", "quantity": "5"}]', '[{"step": "1", "text": "Първата стъпка от рецептата за печена тиква е подготовката на продуктите. Нарязвате тиквата на парчета, а ядките накълцвате на ситно.Поставяте нарязаните парчета тиква в тава, добавяте захарта и рома  и разбърквате добре. Добавяте пръчките канела и карамфила и печете в предварително загрята на 200 градуса фруна за около 50 минути."}, {"step": "2", "text": "След като тиквата е почти готова добавяте и нарязаните на ситно ядки, както и нарязаните на парчена кайсии и стафидите и разбърквате старателно с дървена лъжица. Печете още около 15 минути. Причината ядките и плодовете да се слагат в по-късен момент е, че ако се сложат в самото начало на печенето ще изгорят и няма да имат приятен вкус, докато когато ги прибавите в края на печенето те едновременно ще се се изпекат и ще поемат от вкуса и аромата на печената тиква."}]'],

            ['torta-garash', 'torta garash', 'Торта Гараш', '[
                {
                    "id": "241",
                    "name": " белтъци",
                    "unit": "броя",
                    "quantity": "8"
                },
                {
                    "id": "481",
                    "name": " пудра захар",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "165",
                    "name": " орехи",
                    "unit": "грама",
                    "quantity": "300"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "20"
                },
                {
                    "id": "250",
                    "name": " заквасена сметана",
                    "unit": "грама",
                    "quantity": "300"
                },
                {
                    "id": "497",
                    "name": " шоколад",
                    "unit": "грама",
                    "quantity": "300"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "497",
                    "name": " шоколад",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "25"
                }
            ]', '[]'],
            ['tiramisu', 'tiramisu', 'Тирамису', '[
                {
                    "id": "264",
                    "name": " маскарпоне",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "461",
                    "name": " еспресо",
                    "unit": "милилитра",
                    "quantity": "350"
                },
                {
                    "id": "435",
                    "name": " ром",
                    "unit": "милилитра",
                    "quantity": "40"
                },
                {
                    "id": "456",
                    "name": " бишкоти",
                    "unit": "грама",
                    "quantity": "20"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "5"
                },
                {
                    "id": "481",
                    "name": " пудра захар",
                    "unit": "грама",
                    "quantity": "180"
                },
                {
                    "id": "196",
                    "name": " ванилия",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "179",
                    "name": " какао",
                    "unit": "грама",
                    "quantity": "5"
                }
            ]', '[]'],
            ['shokoladovo-sufle', 'shokoladovo sufle', 'Шоколадово суфле', '[
                {
                    "id": "497",
                    "name": " шоколад",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "7"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "250"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "125"
                },
                {
                    "id": "179",
                    "name": " какао",
                    "unit": "грама",
                    "quantity": "50"
                }
            ]', '[]'],
            ['morkovena-torta-s-maskarpone', 'morkovena torta s maskarpone', 'Морковена торта с маскарпоне', '[
                {
                    "id": "194",
                    "name": " бакпулвер",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "217",
                    "name": " сода бикарбонат",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "202",
                    "name": " канела",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "447",
                    "name": " олио",
                    "unit": "милилитра",
                    "quantity": "200"
                },
                {
                    "id": "46",
                    "name": " стафиди",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "50",
                    "name": " моркови",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "246",
                    "name": " яйца",
                    "unit": "броя",
                    "quantity": "4"
                },
                {
                    "id": "34",
                    "name": " портокал",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "264",
                    "name": " маскарпоне",
                    "unit": "грама",
                    "quantity": "400"
                },
                {
                    "id": "249",
                    "name": " готварска сметана",
                    "unit": "милилитра",
                    "quantity": "200"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "485",
                    "name": " сладко",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "145",
                    "name": " бяло брашно",
                    "unit": "грама",
                    "quantity": "200"
                }
            ]', '[]'],
            ['krem-bryule', 'krem bryule', 'Крем Брюле', '[
                {
                    "id": "243",
                    "name": " жълтъци",
                    "unit": "броя",
                    "quantity": "8"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "200"
                },
                {
                    "id": "249",
                    "name": " готварска сметана",
                    "unit": "милилитра",
                    "quantity": "750"
                },
                {
                    "id": "252",
                    "name": " прясно мляко",
                    "unit": "милилитра",
                    "quantity": "250"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "100"
                }
            ]', '[]'],
            ['tsedeno-kiselo-mlyako-sus-sladko', 'tsedeno kiselo mlyako sus sladko', 'Цедено кисело мляко със сладко', '[
                {
                    "id": "255",
                    "name": " цедено кисело мляко",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "196",
                    "name": " ванилия",
                    "unit": "грама",
                    "quantity": "5"
                },
                {
                    "id": "481",
                    "name": " пудра захар",
                    "unit": "грама",
                    "quantity": "20"
                },
                {
                    "id": "47",
                    "name": " ягоди",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "30"
                },
                {
                    "id": "47",
                    "name": " ягоди",
                    "unit": "грама",
                    "quantity": "100"
                }
            ]', '[]'],
            ['sladuk-salam', 'sladuk salam', 'Сладък салам', '[
                {
                    "id": "478",
                    "name": " обикновени бисквити",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "165",
                    "name": " орехи",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "13",
                    "name": " СУШЕНИ",
                    "unit": "грама",
                    "quantity": "50"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "252",
                    "name": " прясно мляко",
                    "unit": "милилитра",
                    "quantity": "125"
                },
                {
                    "id": "497",
                    "name": " шоколад",
                    "unit": "грама",
                    "quantity": "100"
                },
                {
                    "id": "179",
                    "name": " какао",
                    "unit": "грама",
                    "quantity": "50"
                }
            ]', '[]'],
            ['baklava', 'baklava', 'Баклава', '[
                {
                    "id": "491",
                    "name": " точени кори",
                    "unit": "грама",
                    "quantity": "800"
                },
                {
                    "id": "165",
                    "name": " орехи",
                    "unit": "грама",
                    "quantity": "700"
                },
                {
                    "id": "451",
                    "name": " краве масло",
                    "unit": "грама",
                    "quantity": "250"
                },
                {
                    "id": "462",
                    "name": " захар",
                    "unit": "грама",
                    "quantity": "500"
                },
                {
                    "id": "196",
                    "name": " ванилия",
                    "unit": "броя",
                    "quantity": "2"
                },
                {
                    "id": "32",
                    "name": " лимон",
                    "unit": "броя",
                    "quantity": "1"
                },
                {
                    "id": "429",
                    "name": " вода",
                    "unit": "милилитра",
                    "quantity": "1000"
                }
            ]', '[]'],
        ];

        $_ingredients = $this->performRequest('GET', 'ingredients');
        $_ingredients = collect( json_decode($_ingredients, true)['data'] );
        $i = 1;
        foreach ($_recipes as $key => $value)
        {
            DB::table('recipes')->insert([
                'steps' => $value[4],
                'created_at' => Carbon::now(),
            ]);

            $ingredients = $value[3];

            var_dump($ingredients);
            if(false && !empty($ingredients))
            {
                $ingredients = json_decode($ingredients, true);
                foreach($ingredients as $ingredient)
                {

                    $_ingredient = $_ingredients->where('bg_name', trim($ingredient['name']))->first();
                    var_dump($_ingredient['id']);
                    DB::table('recipe_ingredients')->insert([
                        'recipe_id' => $i,
                        'ingredient_id' => ($_ingredient['id'] ? $_ingredient['id'] : ''),
                        'unit' => $ingredient['unit'],
                        'quantity' => $ingredient['quantity'],
                        'created_at' => Carbon::now(),
                    ]);
                }
            }

            $i++;
        }

    }
}
